SET NAMES UTF8;
DROP DATABASE IF EXISTS foodList;
CREATE DATABASE foodList CHARSET=UTF8;
USE foodList;

CREATE TABLE food(
    id VARCHAR(64),
    name VARCHAR(64),
    img VARCHAR(128),
    img_lg VARCHAR(128),
    effect VARCHAR(1024),
    material VARCHAR(1024),
    detail VARCHAR(2048),
    PRIMARY KEY(id)
);

INSERT INTO food(id,name,img,img_lg,effect,material,detail) VALUES
('F001','香菇腊肠土豆焖饭','001.jpg','001-lg.jpg','大米：富含碳水化合物、富含锰；土豆：和胃、解毒、消肿','大米、腊肠、鲜香菇、土豆、食用油、盐、生抽、糖、香油','1.把大米放入饭煲锅胆内淘洗干净，添入平时煮饭的适量清水，再滴几滴香油浸泡30分钟左右。2.把所需食材清洗干净后切适量大小的丁状。3.锅中放少许油烧热后，放入香菇煸炒出香味。4.再放入腊肠煸炒出油。5.最后放入土豆翻炒均匀。6.调入生抽、盐和糖炒匀。7.把炒好的食材倒入大米中。8.按饭煲煮饭键开始煮饭。9.煮饭程序结束后不要急于打开锅盖，再把米饭闷十分钟。10.拌匀后即可食用。'),
('F002','蛋包饭','002.jpg','002-lg.jpg','鸡蛋：润燥、增强免疫力、护眼明目；胡萝卜：养肝明目、健脾、化痰止咳;青豆：健脾、益气、清热解毒','鸡蛋、米饭、胡萝卜、青豆、油、盐','1.准备好材料，另备一个裱花嘴。2.两个鸡蛋：分离出一个鸡蛋的蛋清，蛋黄与另一全蛋一起打散，加少许盐调味。3.红萝卜、青豆下开水锅，放适量油、盐，焯水5分钟后剩出。4.平底锅刷少许油、开小火，有蛋黄的蛋液倒入平底锅煎成蛋饼、蛋饼表面凝固即关火。5.取裱花嘴在蛋饼上盖出小圈圈，取下的蛋皮放入红萝卜、青豆碗中。6.小勺舀蛋清填满小圈圈。7.再次开小火，蛋白凝固即关火，剩出蛋饼。8.平底锅放油开中火，倒入红萝卜、青豆，小蛋皮翻炒片刻。9.再倒入米饭翻炒，把米饭炒散后放少许盐调味翻拌均匀即可关火。10.炒饭放在蛋饼中间位置。11.两边的蛋饼卷起，美美哒蛋包饭就好了。'),
('F003','香菇油饭','003.jpg','003-lg.jpg','大米：富含碳水化合物、富含锰；土豆：和胃、解毒、消肿','大米、腊肠、鲜香菇、土豆、食用油、盐、生抽、糖、香油','1.把大米放入饭煲锅胆内淘洗干净，添入平时煮饭的适量清水，再滴几滴香油浸泡30分钟左右。2.把所需食材清洗干净后切适量大小的丁状。3.锅中放少许油烧热后，放入香菇煸炒出香味。4.再放入腊肠煸炒出油。5.最后放入土豆翻炒均匀。6.调入生抽、盐和糖炒匀。7.把炒好的食材倒入大米中。8.按饭煲煮饭键开始煮饭。9.煮饭程序结束后不要急于打开锅盖，再把米饭闷十分钟。10.拌匀后即可食用。'),
('F004','香米红薯粥','004.jpg','004-lg.jpg','大米：富含碳水化合物、富含锰；土豆：和胃、解毒、消肿','大米、腊肠、鲜香菇、土豆、食用油、盐、生抽、糖、香油','1.把大米放入饭煲锅胆内淘洗干净，添入平时煮饭的适量清水，再滴几滴香油浸泡30分钟左右。2.把所需食材清洗干净后切适量大小的丁状。3.锅中放少许油烧热后，放入香菇煸炒出香味。4.再放入腊肠煸炒出油。5.最后放入土豆翻炒均匀。6.调入生抽、盐和糖炒匀。7.把炒好的食材倒入大米中。8.按饭煲煮饭键开始煮饭。9.煮饭程序结束后不要急于打开锅盖，再把米饭闷十分钟。10.拌匀后即可食用。'),
('F005','桃花泛','005.jpg','005-lg.jpg','番茄酱：辅助降血压、改善血液循环、扩张血管；蜂蜜：补脾胃、润肺止咳、解毒','大米饭、花生油、猪里脊肉、虾仁、青豆、冬笋、番茄、番茄酱、蜂蜜、生粉、水淀粉、葱花、盐、鸡汤','1.米饭要用隔夜饭，撒上适量的生粉将米饭拌成粒状。2.现在来处理其他食材，大虾剥出虾仁，开背、去除虾线。3.猪里脊肉去筋膜，斜切成薄片。4.虾仁、肉片加少许盐抓一下，肉片加少许水淀分再抓一下，腌制备用。5.冬笋和番茄切成和青豆差不多大小的丁，备些葱花。6.热锅凉油，将肉片滑熟盛出。7.留少许底油爆香葱花。8.加入番茄酱炒匀。9.加番茄丁炒软。10.放入冬笋丁。11.加适量鸡汤烧开。12.加入青豆煮半分钟。13.加入虾仁和滑熟的肉片。14.加适量的盐和蜂蜜调味，浇汁就做好了，盛出备用。如果觉得浇汁不够粘稠可以勾个芡。15.烧热一口不粘锅，将拌好的大米饭均匀的撒在锅底，看不见黑锅底就行了。喷少许水，小火将水份蒸发干。16.另起一锅将油烧至7成热，这时锅巴也水干成型了，将热油浇在锅巴上，煎炸至锅巴成型。17.取出锅巴，稍凉掰成大小适中的块，用热油快速复炸一下控油装盘。18.锅巴与浇汁同时上桌，将浇汁浇在锅巴上就会听到其噼啪作响。19.浇完汁立即开吃。'),
('F006','皮蛋瘦肉粥','006.jpg','006-lg.jpg','大米：富含碳水化合物、富含锰；姜：降逆止呕、化痰止咳、散寒解表','大米、皮蛋、瘦肉、香葱、盐、香油、姜','1.把大米淘洗干净后，放入容器中添入适量的水和一汤匙香油，浸泡30分钟左右。2.把皮蛋和瘦肉切小丁，姜去皮切细丝，香葱切葱花。3.在瘦肉中加入少许盐腌制20分钟。4.锅中添适量水烧开后放入瘦肉煮三分钟，捞去浮沫。5.再放入一半的皮蛋和姜丝，煮两分钟左右。6.把浸泡好的大米捞出放入高压锅胆内。7.再把煮好的皮蛋瘦肉连汤水倒入锅中。8.添入适量的清水。9.按煮粥键开始煮粥。10.到时间后把剩余的皮蛋倒入锅中，调入适量的盐，用饭勺翻匀盖上锅盖焖5分钟。11.撒适量葱花即可。'),
('F007','生炒糯米饭','007.jpg','007-lg.jpg','糯米：补中益气、健脾止泻、解毒；胡萝卜：养肝明目、健脾、化痰止咳；猪肉：补肾、滋阴、益气','糯米、玉米粒、毛豆、胡萝卜、猪肉、鸡蛋、香葱、食用油、料酒、清水、盐、鸡精','1.成品图。2.糯米提前一晚浸泡，夏天气温高需放冰箱内浸泡。3.胡萝卜切丁，猪肉分瘦肉和肥肉切丁，或直接用五花肉，玉米粒，毛豆洗干净，鸡蛋磕碗里，浸泡好的糯米洗干净沥水备用。4.鸡蛋中加少许食盐打散，平底锅加少许油烧热倒入蛋液摊成鸡蛋饼，煎好一面翻面再煎一会儿至熟。5.摊好的鸡蛋饼切条再切片，葱切花。6.锅中倒油适量食用油烧热下肥肉大火翻炒片刻倒入瘦肉翻炒至微黄。7.加入玉米粒，毛豆和胡萝卜丁大火翻炒。8.翻炒至青豆微熟。9.倒入沥水的糯米大火翻炒。10.炒至水分微干调入适量食盐，转中火，炒至糯米变粘连结块的时候沿锅边淋入少许料酒中火翻炒片刻。11.随后分多次沿锅边淋入清水翻炒，并且盖锅盖焖片刻。此后一直用中火翻炒，感觉干了就淋清水翻炒并盖锅盖焖片刻依次重复至糯米炒熟不硬芯即可，这个过程大概30分钟左右。调入少许鸡精，加入鸡蛋和葱花炒匀即可关火。12.香香糯糯的炒糯米饭就做好了，盛出开吃！'),
('F008','腊肠煲仔饭','008.jpg','008-lg.jpg','大米：富含碳水化合物、富含锰；油菜：清热解毒、活血祛瘀、散瘀消肿；西兰花：和胃、补脾、强筋骨','大米、腊肠、油菜、西兰花、香菇、鸡蛋、油、盐、糖、耗油、生抽、清水','1.准备食材。2.大米用清水浸泡半个小时，洗净。3.砂锅里刷一层油（底部和周边都要刷）。4.将大米放入砂锅，根据大米的吸水性加适当的水。5.用筷子搅拌几圈，防止粘锅。6.开中火使米饭煮开，再用筷子搅拌几圈，转小火，这时可以转锅，使底部都受热。7.将腊肠切片，香菇划十字花。8.烧点水，加两滴油，将油菜和西兰花焯一分钟捞出。9.将香菇焯水。10.这时米饭的水分已煮干，将腊肠码入。11.打入鸡蛋，放上焯好的青菜，盖盖继续小火煮。12.来调个汁：白糖放入碗中。13.加入蚝油。14.加入生抽。15.加入盐。16.两汤匙清水，搅拌均匀。17.蛋清凝固后，将调好的汁浇在蔬菜上。18.关火，焖两分钟就可以吃了。砂锅聚温效果好，端的时候记得戴隔热手套，以免烫伤。19.一口饭、一口菜，或者拌起来吃，都不错哦。20.这锅是没有放鸡蛋的，也好吃呢。'),
('F009','原味大米戚风蛋糕','009.jpg','009-lg.jpg','鸡蛋：润燥、增强免疫力、护眼明目','大米粉、鸡蛋、糖、牛奶、水、油、醋、香草精','1.准备材料，蛋清蛋黄分开。2.先做蛋黄糊部分，蛋黄里加入油，牛奶╱水。3.混匀，加入大米粉。4.过筛。5.混匀。6.放一边备用。7.打发蛋清，打至粗泡加第一次糖。8.有纹路后加第二次糖。9.打至有纹路不消失，加第三次糖。10.提起打蛋器有弯钩就可以了。11.取三分之一蛋白到蛋黄糊里。12.混匀。13.再加入三分之一蛋白。14.翻拌均匀。15.拌好的面糊倒入剩下的蛋白中。16.翻拌均匀。17.装入模具，轻震几下，震出气泡，上下火160℃，50分钟。18.出炉倒扣晾凉。19.脱模切块。'),
('F0010','黑米大米粥','010.jpg','010-lg.jpg','黑米：明目、暖肝、健脾；大米：富含碳水化合物、富含锰','黑米、大米、水','1.用杯子装好米。2.把米倒入电饭煲，清洗干净，倒入8杯水。3.预约煲粥功能。4.时间到就好了。'),
('F0011','黄瓜爱心大米饼','011.jpg','011-lg.jpg','黄瓜：利水、清热、解毒；胡萝卜：养肝明目、健脾、化痰止咳；鸡蛋：润燥、增强免疫力、护眼明目；','大米饭、黄瓜、胡萝卜、鸡蛋、番茄酱、油、盐、酱油、料酒、五香粉、葱、面粉','1.准备食材。2.所有食材全部混合在一个盆里。3.拌匀。4.热锅下油。5.心形模具放锅里，里面放两勺大米混合物，一分钟后翻面，如果模具和饼粘在一起，用牙签在模具和饼之间轻轻划一下，就可以脱模了。6.两面金黄即可。7.中间放点番茄酱，可以蘸着吃。'),
('F0012','山药香米粥','012.jpg','012-lg.jpg','','长粒香米、圆糯米、黑香米、普通大米、山药、红枣、枸杞','1.准备配料表的所需食材。2.山药去皮，洗干净切块待用，剩下的食材用水淘洗干净待用。3.然后高压锅里添水，根据自己家里人数做，喜欢喝干点的就少放水，喜欢有汤水的就多添水。4.把清洗干净切好块的山药倒入锅里。5.盖上锅盖，启动五谷饭，时间显示为15分钟。6.15分钟后不要急着打开锅盖，等高压锅的排气阀落下来再打开盖子。出锅后因为有黑香米，所以熬制出来的颜色很漂亮。');

SELECT * FROM food;